espressif/esp-idf/components/soc/esp32c3/register/soc/rtc_i2c_reg.h
#define RTC_I2C_SCL_START_PERIOD_REG          (DR_REG_RTC_I2C_BASE + 0x001c)
/* RTC_I2C_SCL_START_PERIOD : R/W ;bitpos:[19:0] ;default: 20'b1000 ; */
/*description: time period for SCL to toggle after I2C start is triggered*/
#define RTC_I2C_SCL_START_PERIOD  0x000FFFFF
#define RTC_I2C_SCL_START_PERIOD_M  ((RTC_I2C_SCL_START_PERIOD_V)<<(RTC_I2C_SCL_START_PERIOD_S))
#define RTC_I2C_SCL_START_PERIOD_V  0xFFFFF
#define RTC_I2C_SCL_START_PERIOD_S  0

#define RTC_I2C_SCL_STOP_PERIOD_REG          (DR_REG_RTC_I2C_BASE + 0x0020)
/* RTC_I2C_SCL_STOP_PERIOD : R/W ;bitpos:[19:0] ;default: 20'b1000 ; */
/*description: time period for SCL to stop after I2C end is triggered*/
#define RTC_I2C_SCL_STOP_PERIOD  0x000FFFFF
#define RTC_I2C_SCL_STOP_PERIOD_M  ((RTC_I2C_SCL_STOP_PERIOD_V)<<(RTC_I2C_SCL_STOP_PERIOD_S))
#define RTC_I2C_SCL_STOP_PERIOD_V  0xFFFFF
#define RTC_I2C_SCL_STOP_PERIOD_S  0

#define RTC_I2C_INT_CLR_REG          (DR_REG_RTC_I2C_BASE + 0x0024)
/* RTC_I2C_DETECT_START_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: clear detect start interrupt*/
#define RTC_I2C_DETECT_START_INT_CLR  (BIT(8))
#define RTC_I2C_DETECT_START_INT_CLR_M  (BIT(8))
#define RTC_I2C_DETECT_START_INT_CLR_V  0x1
#define RTC_I2C_DETECT_START_INT_CLR_S  8
/* RTC_I2C_TX_DATA_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: clear transit load data complete interrupt*/
#define RTC_I2C_TX_DATA_INT_CLR  (BIT(7))
#define RTC_I2C_TX_DATA_INT_CLR_M  (BIT(7))
#define RTC_I2C_TX_DATA_INT_CLR_V  0x1
#define RTC_I2C_TX_DATA_INT_CLR_S  7
/* RTC_I2C_RX_DATA_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: clear receive data interrupt*/
#define RTC_I2C_RX_DATA_INT_CLR  (BIT(6))
#define RTC_I2C_RX_DATA_INT_CLR_M  (BIT(6))
#define RTC_I2C_RX_DATA_INT_CLR_V  0x1
#define RTC_I2C_RX_DATA_INT_CLR_S  6
/* RTC_I2C_ACK_ERR_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: clear ack error interrupt*/
#define RTC_I2C_ACK_ERR_INT_CLR  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_CLR_M  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_CLR_V  0x1
#define RTC_I2C_ACK_ERR_INT_CLR_S  5
/* RTC_I2C_TIMEOUT_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: clear time out interrupt*/
#define RTC_I2C_TIMEOUT_INT_CLR  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_CLR_M  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_CLR_V  0x1
#define RTC_I2C_TIMEOUT_INT_CLR_S  4
/* RTC_I2C_TRANS_COMPLETE_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: clear transit complete interrupt*/
#define RTC_I2C_TRANS_COMPLETE_INT_CLR  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_CLR_M  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_CLR_V  0x1
#define RTC_I2C_TRANS_COMPLETE_INT_CLR_S  3
/* RTC_I2C_MASTER_TRAN_COMP_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: clear master transit complete interrupt*/
#define RTC_I2C_MASTER_TRAN_COMP_INT_CLR  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_CLR_M  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_CLR_V  0x1
#define RTC_I2C_MASTER_TRAN_COMP_INT_CLR_S  2
/* RTC_I2C_ARBITRATION_LOST_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: clear arbitration lost interrupt*/
#define RTC_I2C_ARBITRATION_LOST_INT_CLR  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_CLR_M  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_CLR_V  0x1
#define RTC_I2C_ARBITRATION_LOST_INT_CLR_S  1
/* RTC_I2C_SLAVE_TRAN_COMP_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: clear slave transit complete interrupt*/
#define RTC_I2C_SLAVE_TRAN_COMP_INT_CLR  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_CLR_M  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_CLR_V  0x1
#define RTC_I2C_SLAVE_TRAN_COMP_INT_CLR_S  0

#define RTC_I2C_INT_RAW_REG          (DR_REG_RTC_I2C_BASE + 0x0028)
/* RTC_I2C_DETECT_START_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: detect start interrupt raw*/
#define RTC_I2C_DETECT_START_INT_RAW  (BIT(8))
#define RTC_I2C_DETECT_START_INT_RAW_M  (BIT(8))
#define RTC_I2C_DETECT_START_INT_RAW_V  0x1
#define RTC_I2C_DETECT_START_INT_RAW_S  8
/* RTC_I2C_TX_DATA_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: transit data interrupt raw*/
#define RTC_I2C_TX_DATA_INT_RAW  (BIT(7))
#define RTC_I2C_TX_DATA_INT_RAW_M  (BIT(7))
#define RTC_I2C_TX_DATA_INT_RAW_V  0x1
#define RTC_I2C_TX_DATA_INT_RAW_S  7
/* RTC_I2C_RX_DATA_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: receive data interrupt raw*/
#define RTC_I2C_RX_DATA_INT_RAW  (BIT(6))
#define RTC_I2C_RX_DATA_INT_RAW_M  (BIT(6))
#define RTC_I2C_RX_DATA_INT_RAW_V  0x1
#define RTC_I2C_RX_DATA_INT_RAW_S  6
/* RTC_I2C_ACK_ERR_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: ack error interrupt raw*/
#define RTC_I2C_ACK_ERR_INT_RAW  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_RAW_M  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_RAW_V  0x1
#define RTC_I2C_ACK_ERR_INT_RAW_S  5
/* RTC_I2C_TIMEOUT_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: time out interrupt raw*/
#define RTC_I2C_TIMEOUT_INT_RAW  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_RAW_M  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_RAW_V  0x1
#define RTC_I2C_TIMEOUT_INT_RAW_S  4
/* RTC_I2C_TRANS_COMPLETE_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: transit complete interrupt raw*/
#define RTC_I2C_TRANS_COMPLETE_INT_RAW  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_RAW_M  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_RAW_V  0x1
#define RTC_I2C_TRANS_COMPLETE_INT_RAW_S  3
/* RTC_I2C_MASTER_TRAN_COMP_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: master transit complete interrupt raw*/
#define RTC_I2C_MASTER_TRAN_COMP_INT_RAW  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_RAW_M  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_RAW_V  0x1
#define RTC_I2C_MASTER_TRAN_COMP_INT_RAW_S  2
/* RTC_I2C_ARBITRATION_LOST_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: arbitration lost interrupt raw*/
#define RTC_I2C_ARBITRATION_LOST_INT_RAW  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_RAW_M  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_RAW_V  0x1
#define RTC_I2C_ARBITRATION_LOST_INT_RAW_S  1
/* RTC_I2C_SLAVE_TRAN_COMP_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: slave transit complete interrupt raw*/
#define RTC_I2C_SLAVE_TRAN_COMP_INT_RAW  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_RAW_M  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_RAW_V  0x1
#define RTC_I2C_SLAVE_TRAN_COMP_INT_RAW_S  0

#define RTC_I2C_INT_ST_REG          (DR_REG_RTC_I2C_BASE + 0x002c)
/* RTC_I2C_DETECT_START_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: detect start interrupt state*/
#define RTC_I2C_DETECT_START_INT_ST  (BIT(8))
#define RTC_I2C_DETECT_START_INT_ST_M  (BIT(8))
#define RTC_I2C_DETECT_START_INT_ST_V  0x1
#define RTC_I2C_DETECT_START_INT_ST_S  8
/* RTC_I2C_TX_DATA_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: transit data interrupt state*/
#define RTC_I2C_TX_DATA_INT_ST  (BIT(7))
#define RTC_I2C_TX_DATA_INT_ST_M  (BIT(7))
#define RTC_I2C_TX_DATA_INT_ST_V  0x1
#define RTC_I2C_TX_DATA_INT_ST_S  7
/* RTC_I2C_RX_DATA_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: receive data interrupt state*/
#define RTC_I2C_RX_DATA_INT_ST  (BIT(6))
#define RTC_I2C_RX_DATA_INT_ST_M  (BIT(6))
#define RTC_I2C_RX_DATA_INT_ST_V  0x1
#define RTC_I2C_RX_DATA_INT_ST_S  6
/* RTC_I2C_ACK_ERR_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: ack error interrupt state*/
#define RTC_I2C_ACK_ERR_INT_ST  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_ST_M  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_ST_V  0x1
#define RTC_I2C_ACK_ERR_INT_ST_S  5
/* RTC_I2C_TIMEOUT_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: time out interrupt state*/
#define RTC_I2C_TIMEOUT_INT_ST  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_ST_M  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_ST_V  0x1
#define RTC_I2C_TIMEOUT_INT_ST_S  4
/* RTC_I2C_TRANS_COMPLETE_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: transit complete interrupt state*/
#define RTC_I2C_TRANS_COMPLETE_INT_ST  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_ST_M  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_ST_V  0x1
#define RTC_I2C_TRANS_COMPLETE_INT_ST_S  3
/* RTC_I2C_MASTER_TRAN_COMP_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: master transit complete interrupt state*/
#define RTC_I2C_MASTER_TRAN_COMP_INT_ST  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_ST_M  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_ST_V  0x1
#define RTC_I2C_MASTER_TRAN_COMP_INT_ST_S  2
/* RTC_I2C_ARBITRATION_LOST_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: arbitration lost interrupt state*/
#define RTC_I2C_ARBITRATION_LOST_INT_ST  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_ST_M  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_ST_V  0x1
#define RTC_I2C_ARBITRATION_LOST_INT_ST_S  1
/* RTC_I2C_SLAVE_TRAN_COMP_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: slave transit complete interrupt state*/
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ST  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ST_M  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ST_V  0x1
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ST_S  0

#define RTC_I2C_INT_ENA_REG          (DR_REG_RTC_I2C_BASE + 0x0030)
/* RTC_I2C_DETECT_START_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: enable detect start interrupt*/
#define RTC_I2C_DETECT_START_INT_ENA  (BIT(8))
#define RTC_I2C_DETECT_START_INT_ENA_M  (BIT(8))
#define RTC_I2C_DETECT_START_INT_ENA_V  0x1
#define RTC_I2C_DETECT_START_INT_ENA_S  8
/* RTC_I2C_TX_DATA_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: enable transit data interrupt*/
#define RTC_I2C_TX_DATA_INT_ENA  (BIT(7))
#define RTC_I2C_TX_DATA_INT_ENA_M  (BIT(7))
#define RTC_I2C_TX_DATA_INT_ENA_V  0x1
#define RTC_I2C_TX_DATA_INT_ENA_S  7
/* RTC_I2C_RX_DATA_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: enable receive data interrupt*/
#define RTC_I2C_RX_DATA_INT_ENA  (BIT(6))
#define RTC_I2C_RX_DATA_INT_ENA_M  (BIT(6))
#define RTC_I2C_RX_DATA_INT_ENA_V  0x1
#define RTC_I2C_RX_DATA_INT_ENA_S  6
/* RTC_I2C_ACK_ERR_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: enable eack error interrupt*/
#define RTC_I2C_ACK_ERR_INT_ENA  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_ENA_M  (BIT(5))
#define RTC_I2C_ACK_ERR_INT_ENA_V  0x1
#define RTC_I2C_ACK_ERR_INT_ENA_S  5
/* RTC_I2C_TIMEOUT_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: enable time out interrupt*/
#define RTC_I2C_TIMEOUT_INT_ENA  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_ENA_M  (BIT(4))
#define RTC_I2C_TIMEOUT_INT_ENA_V  0x1
#define RTC_I2C_TIMEOUT_INT_ENA_S  4
/* RTC_I2C_TRANS_COMPLETE_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: enable transit complete interrupt*/
#define RTC_I2C_TRANS_COMPLETE_INT_ENA  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_ENA_M  (BIT(3))
#define RTC_I2C_TRANS_COMPLETE_INT_ENA_V  0x1
#define RTC_I2C_TRANS_COMPLETE_INT_ENA_S  3
/* RTC_I2C_MASTER_TRAN_COMP_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: enable master transit complete interrupt*/
#define RTC_I2C_MASTER_TRAN_COMP_INT_ENA  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_ENA_M  (BIT(2))
#define RTC_I2C_MASTER_TRAN_COMP_INT_ENA_V  0x1
#define RTC_I2C_MASTER_TRAN_COMP_INT_ENA_S  2
/* RTC_I2C_ARBITRATION_LOST_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: enable arbitration lost interrupt*/
#define RTC_I2C_ARBITRATION_LOST_INT_ENA  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_ENA_M  (BIT(1))
#define RTC_I2C_ARBITRATION_LOST_INT_ENA_V  0x1
#define RTC_I2C_ARBITRATION_LOST_INT_ENA_S  1
/* RTC_I2C_SLAVE_TRAN_COMP_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: enable slave transit complete interrupt*/
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ENA  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ENA_M  (BIT(0))
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ENA_V  0x1
#define RTC_I2C_SLAVE_TRAN_COMP_INT_ENA_S  0

#define RTC_I2C_DATA_REG          (DR_REG_RTC_I2C_BASE + 0x0034)
/* RTC_I2C_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: i2c done*/
#define RTC_I2C_DONE  (BIT(31))
#define RTC_I2C_DONE_M  (BIT(31))
#define RTC_I2C_DONE_V  0x1
#define RTC_I2C_DONE_S  31
/* RTC_I2C_SLAVE_TX_DATA : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: data sent by slave*/
#define RTC_I2C_SLAVE_TX_DATA  0x000000FF
#define RTC_I2C_SLAVE_TX_DATA_M  ((RTC_I2C_SLAVE_TX_DATA_V)<<(RTC_I2C_SLAVE_TX_DATA_S))
#define RTC_I2C_SLAVE_TX_DATA_V  0xFF
#define RTC_I2C_SLAVE_TX_DATA_S  8
/* RTC_I2C_RDATA : RO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: data received*/
#define RTC_I2C_RDATA  0x000000FF
#define RTC_I2C_RDATA_M  ((RTC_I2C_RDATA_V)<<(RTC_I2C_RDATA_S))
#define RTC_I2C_RDATA_V  0xFF
#define RTC_I2C_RDATA_S  0

