espressif/esp-idf/components/soc/esp32c3/register/soc/rtc_i2c_reg.h
#define RTC_I2C_CMD11_REG          (DR_REG_RTC_I2C_BASE + 0x0064)
/* RTC_I2C_COMMAND11_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command11_done*/
#define RTC_I2C_COMMAND11_DONE  (BIT(31))
#define RTC_I2C_COMMAND11_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND11_DONE_V  0x1
#define RTC_I2C_COMMAND11_DONE_S  31
/* RTC_I2C_COMMAND11 : R/W ;bitpos:[13:0] ;default: 14'h0901 ; */
/*description: command11*/
#define RTC_I2C_COMMAND11  0x00003FFF
#define RTC_I2C_COMMAND11_M  ((RTC_I2C_COMMAND11_V)<<(RTC_I2C_COMMAND11_S))
#define RTC_I2C_COMMAND11_V  0x3FFF
#define RTC_I2C_COMMAND11_S  0

#define RTC_I2C_CMD12_REG          (DR_REG_RTC_I2C_BASE + 0x0068)
/* RTC_I2C_COMMAND12_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command12_done*/
#define RTC_I2C_COMMAND12_DONE  (BIT(31))
#define RTC_I2C_COMMAND12_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND12_DONE_V  0x1
#define RTC_I2C_COMMAND12_DONE_S  31
/* RTC_I2C_COMMAND12 : R/W ;bitpos:[13:0] ;default: 14'h1701 ; */
/*description: command12*/
#define RTC_I2C_COMMAND12  0x00003FFF
#define RTC_I2C_COMMAND12_M  ((RTC_I2C_COMMAND12_V)<<(RTC_I2C_COMMAND12_S))
#define RTC_I2C_COMMAND12_V  0x3FFF
#define RTC_I2C_COMMAND12_S  0

#define RTC_I2C_CMD13_REG          (DR_REG_RTC_I2C_BASE + 0x006c)
/* RTC_I2C_COMMAND13_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command13_done*/
#define RTC_I2C_COMMAND13_DONE  (BIT(31))
#define RTC_I2C_COMMAND13_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND13_DONE_V  0x1
#define RTC_I2C_COMMAND13_DONE_S  31
/* RTC_I2C_COMMAND13 : R/W ;bitpos:[13:0] ;default: 14'h1901 ; */
/*description: command13*/
#define RTC_I2C_COMMAND13  0x00003FFF
#define RTC_I2C_COMMAND13_M  ((RTC_I2C_COMMAND13_V)<<(RTC_I2C_COMMAND13_S))
#define RTC_I2C_COMMAND13_V  0x3FFF
#define RTC_I2C_COMMAND13_S  0

#define RTC_I2C_CMD14_REG          (DR_REG_RTC_I2C_BASE + 0x0070)
/* RTC_I2C_COMMAND14_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command14_done*/
#define RTC_I2C_COMMAND14_DONE  (BIT(31))
#define RTC_I2C_COMMAND14_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND14_DONE_V  0x1
#define RTC_I2C_COMMAND14_DONE_S  31
/* RTC_I2C_COMMAND14 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: command14*/
#define RTC_I2C_COMMAND14  0x00003FFF
#define RTC_I2C_COMMAND14_M  ((RTC_I2C_COMMAND14_V)<<(RTC_I2C_COMMAND14_S))
#define RTC_I2C_COMMAND14_V  0x3FFF
#define RTC_I2C_COMMAND14_S  0

#define RTC_I2C_CMD15_REG          (DR_REG_RTC_I2C_BASE + 0x0074)
/* RTC_I2C_COMMAND15_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command15_done*/
#define RTC_I2C_COMMAND15_DONE  (BIT(31))
#define RTC_I2C_COMMAND15_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND15_DONE_V  0x1
#define RTC_I2C_COMMAND15_DONE_S  31
/* RTC_I2C_COMMAND15 : R/W ;bitpos:[13:0] ;default: 14'h0 ; */
/*description: command15*/
#define RTC_I2C_COMMAND15  0x00003FFF
#define RTC_I2C_COMMAND15_M  ((RTC_I2C_COMMAND15_V)<<(RTC_I2C_COMMAND15_S))
#define RTC_I2C_COMMAND15_V  0x3FFF
#define RTC_I2C_COMMAND15_S  0

#define RTC_I2C_DATE_REG          (DR_REG_RTC_I2C_BASE + 0x00FC)
/* RTC_I2C_DATE : R/W ;bitpos:[27:0] ;default: 28'h1905310 ; */
/*description: */
#define RTC_I2C_DATE  0x0FFFFFFF
#define RTC_I2C_DATE_M  ((RTC_I2C_DATE_V)<<(RTC_I2C_DATE_S))
#define RTC_I2C_DATE_V  0xFFFFFFF
#define RTC_I2C_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_RTC_I2C_REG_H_ */
